#### BRepBuilderGeometryId Members

---

|  |
| --- |
| BRepBuilderGeometryId Class   Constructors   Methods   Properties   See Also |

The  BRepBuilderGeometryId  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | BRepBuilderGeometryId | Copy constructor |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  BRepBuilderGeometryId |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

BRepBuilderGeometryId Class

Autodesk.Revit.DB Namespace